app/controllers/comments_controller.rb

  def new
    @comment = Comment.new
    @plan = Plan.find(params[:plan_id])
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @comment = Comment.new(comment_params)
    @comment.plan_id = get_plan_id
    @comment.user_id = current_user.id
    if @comment.save!
---
INSERT INTO "comments" ("text", "user_id", "plan_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "Great plan!"], ["user_id", 1], ["plan_id", 1], ["created_at", "2018-05-01 01:07:50.484116"], ["updated_at", "2018-05-01 01:07:50.484116"]]