app/controllers/plans_controller.rb

INSERT INTO "plans" ("time_per_workout", "equipment_needed", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)  [["time_per_workout", 60], ["equipment_needed", "Dumbbells"], ["created_at", "2018-04-28 12:35:25.865609"], ["updated_at", "2018-04-28 12:35:25.865609"], ["name", "Dumbbell Only Full Body"]]
---
  def create
    @plan = Plan.new(plan_params)
    if @plan.save!

SELECT "plans".* FROM "plans"
---
  def index
    @plans = Plan.all

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_plan
    @plan = Plan.find(params[:id])