app/controllers/workouts_controller.rb

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @plan = Plan.find(params[:plan_id])

INSERT INTO "workouts" ("name", "muscle_group", "equipment", "time_length", "reps", "sets", "created_at", "updated_at", "day", "plan_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @workout = Workout.new(workout_params)
    @workout.plan_id = plan_id_params
    if @workout.save!

SELECT "workouts".* FROM "workouts"
---
  def index
    @workouts = Workout.all

UPDATE "workouts" SET "equipment" = ?, "time_length" = ?, "updated_at" = ? WHERE "workouts"."id" = ?  [["equipment", "Dumbbell"], ["time_length", 60], ["updated_at", "2018-04-28 11:40:50.596568"], ["id", 1]]
---
  def update
    if @workout.update(workout_params)

DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 3]]
---
  def destroy
    @workout.destroy

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_workout
    @plan = Plan.find(params[:plan_id])
    @workout = Workout.find(params[:id])