app/controllers/workouts_controller.rb

SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_workout
    @workout = Workout.find(params[:id])