app/models/user.rb

   def self.from_omniauth(auth)
     where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
---
INSERT INTO "users" ("email", "encrypted_password", "provider", "uid") VALUES (?, ?, ?, ?)  [["email", "heriberto@melo.nyc"], ["encrypted_password", "$2a$11$5gsfp3o5559TrDEQZAmjg.5utCJSge95kgE3RcX31OPPbS3yRsW7K"], ["provider", "google_oauth2"], ["uid", "110740901278065310692"]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "google_oauth2"], ["uid", "110740901278065310692"], ["LIMIT", 1]]