app/views/plans/show.html.erb

SELECT "workouts".* FROM "workouts" WHERE "workouts"."plan_id" = ?  [["plan_id", 1]]
---
  <h3 class="col-lg-8 mx-auto"><%= day_of_week %></h3>
  <% @plan.workouts.each do |workout| %>